Repository: eslam148/NOLCarRental
Catalog: src/NOL.API/Resources/SharedResource.*.resx
Languages: ar

# OperationSuccessful
source: Operation completed successfully
ar: تمت العملية بنجاح

source: Resource not found
ar: المورد غير موجود

source: Unauthorized access
ar: وصول غير مخول

source: Access forbidden
ar: الوصول محظور

source: Validation error
ar: خطأ في التحقق من البيانات

# CarNotAvailable
source: Car is not available for the selected dates
ar: السيارة غير متاحة للتواريخ المحددة

# BookingCreated
source: Booking created successfully
ar: تم إنشاء الحجز بنجاح

# BookingCanceled
source: Booking canceled successfully
ar: تم إلغاء الحجز بنجاح

# PaymentProcessed
source: Payment processed successfully
ar: تمت معالجة الدفع بنجاح

source: Payment failed
ar: فشلت عملية الدفع

source: Invalid credentials
ar: بيانات اعتماد غير صحيحة

# UserRegistered
source: User registered successfully
ar: تم تسجيل المستخدم بنجاح

source: Email already exists
ar: البريد الإلكتروني موجود بالفعل

source: Internal server error
ar: خطأ داخلي في الخادم

source: Login successful
ar: تم تسجيل الدخول بنجاح

# CarsRetrieved
source: Cars retrieved successfully
ar: تم استرداد السيارات بنجاح

# CarRetrieved
source: Car retrieved successfully
ar: تم استرداد السيارة بنجاح

source: Car not found
ar: السيارة غير موجودة

# BranchesRetrieved
source: Branches retrieved successfully
ar: تم استرجاع الفروع بنجاح

# BranchRetrieved
source: Branch retrieved successfully
ar: تم استرداد الفرع بنجاح

# CategoriesRetrieved
source: Categories retrieved successfully
ar: تم استرداد الفئات بنجاح

# CategoryRetrieved
source: Category retrieved successfully
ar: تم استرداد الفئة بنجاح

# BookingsRetrieved
source: Bookings retrieved successfully
ar: تم استرداد الحجوزات بنجاح

# BookingRetrieved
source: Booking retrieved successfully
ar: تم استرداد الحجز بنجاح

source: Booking not found
ar: لم يتم العثور على الحجز

# ExtrasRetrieved
source: Extra services retrieved successfully
ar: تم استرداد الخدمات الإضافية بنجاح

# ExtraRetrieved
source: Extra service retrieved successfully
ar: تم استرداد الخدمة الإضافية بنجاح

# AdvertisementsRetrieved
source: Advertisements retrieved successfully
ar: تم استرداد الإعلانات بنجاح

# FeaturedAdvertisementsRetrieved
source: Featured advertisements retrieved successfully
ar: تم استرجاع الإعلانات المميزة بنجاح

# AdvertisementRetrieved
source: Advertisement retrieved successfully
ar: تم استرداد الإعلان بنجاح

source: Advertisement not found
ar: الإعلان غير موجود

# AdvertisementCreated
source: Advertisement created successfully
ar: تم إنشاء الإعلان بنجاح

# AdvertisementUpdated
source: Advertisement updated successfully
ar: تم تحديث الإعلان بنجاح

# AdvertisementDeleted
source: Advertisement deleted successfully
ar: تم حذف الإعلان بنجاح

# AdvertisementStatusUpdated
source: Advertisement status updated successfully
ar: تم تحديث حالة الإعلان بنجاح

# ViewCountIncremented
source: View count incremented successfully
ar: تمت زيادة عدد المشاهدات بنجاح

# ClickCountIncremented
source: Click count incremented successfully
ar: تم زيادة عدد النقرات بنجاح

source: Invalid date range
ar: نطاق التاريخ غير صحيح

# CannotSetBothCarAndCategory
source: Cannot set both car and category for advertisement
ar: لا يمكن تعيين كل من السيارة والفئة للإعلان

# MustSetEitherCarOrCategory
source: Must set either car or category for advertisement
ar: يجب تحديد السيارة أو الفئة للإعلان

# ReceivingBranchNotAvailable
source: Receiving branch is not available
ar: فرع الاستلام غير متاح

# DeliveryBranchNotAvailable
source: Delivery branch is not available
ar: فرع التوصيل غير متوفر

# LoyaltyPointSummaryRetrieved
source: Loyalty point summary retrieved successfully
ar: تم استرداد ملخص نقاط الولاء بنجاح

# LoyaltyPointTransactionsRetrieved
source: Loyalty point transactions retrieved successfully
ar: تم استرداد معاملات نقاط الولاء بنجاح

# LoyaltyPointsAwarded
source: Loyalty points awarded successfully
ar: تم منح نقاط الولاء بنجاح

# LoyaltyPointsRedeemed
source: Loyalty points redeemed successfully
ar: تم استبدال نقاط الولاء بنجاح

# MinimumRedemptionNotMet
source: Minimum redemption amount not met. You need at least 100 points to redeem.
ar: لم يتم استيفاء الحد الأدنى للاستبدال. تحتاج إلى 100 نقطة على الأقل للاستبدال.

# InsufficientLoyaltyPoints
source: Insufficient loyalty points for this redemption
ar: نقاط ولاء غير كافية لهذا الاستبدال

# BookingPointsProcessed
source: Booking points processed successfully
ar: تم معالجة نقاط الحجز بنجاح

# ExpiredPointsProcessed
source: Expired points processed successfully
ar: تم معالجة النقاط المنتهية الصلاحية بنجاح

source: Booking canceled successfully
ar: تم إلغاء الحجز بنجاح

# BookingCannotBeCanceled
source: This booking cannot be canceled due to its current status
ar: لا يمكن إلغاء هذا الحجز بسبب حالته الحالية

# CannotCancelStartedBooking
source: Cannot cancel a booking that has already started
ar: لا يمكن إلغاء حجز بدأ بالفعل

# PasswordsDoNotMatch
source: Password and confirmation password do not match
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقتان

# PasswordRequired
source: Password and confirm password are required
ar: كلمة المرور وتأكيد كلمة المرور مطلوبان

# EmailAlreadyConfirmed
source: Email is already confirmed
ar: البريد الإلكتروني مؤكد بالفعل

# EmailSendingFailed
source: Failed to send email
ar: فشل في إرسال البريد الإلكتروني

# OtpExpired
source: OTP code has expired
ar: انتهت صلاحية رمز التحقق

# InvalidOtp
source: Invalid OTP code
ar: رمز التحقق غير صحيح

# EmailVerified
source: Email verified successfully
ar: تم تأكيد البريد الإلكتروني بنجاح

# EmailVerificationSent
source: Email verification code sent successfully
ar: تم إرسال رمز تأكيد البريد الإلكتروني بنجاح

# PasswordResetEmailSent
source: Password reset email sent successfully
ar: تم إرسال بريد إعادة تعيين كلمة المرور بنجاح

source: Password reset failed
ar: فشل في إعادة تعيين كلمة المرور

source: Password reset successful
ar: تم إعادة تعيين كلمة المرور بنجاح

# PasswordChanged
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Password change failed
ar: فشل في تغيير كلمة المرور

# EmailNotVerified
source: Email not verified. Please check your email for verification code
ar: البريد الإلكتروني غير مؤكد. يرجى التحقق من بريدك الإلكتروني للحصول على رمز التحقق

# RegistrationSuccessful
source: Registration successful. Please check your email for verification
ar: تم التسجيل بنجاح. يرجى التحقق من بريدك الإلكتروني للتحقق

source: Invalid Email Or Password
ar: البريد الإلكتروني أو كلمة المرور غير صالحة

# PointsAlreadyAwarded
source: Points have already been awarded for this booking
ar: تم منح النقاط بالفعل لهذا الحجز

# UnauthorizedToModifyBooking
source: You are not authorized to modify this booking
ar: غير مخول لك بتعديل هذا الحجز

source: Must Rent Car To Rate
ar: يجب استئجار سيارة للتقييم
